## 1.导包

In [1]:

import os

import pandas as pd
import numpy as np
import matplotlib as plt
%matplotlib inline

#设置行不限制数量
#pd.set_option('display.max_rows',None)
#最后的的参数可以限制输出行的数量

#设置列不限制数量
pd.set_option('display.max_columns',None)

In [2]:
!ls

DataTransforme.ipynb
公开数据集
更新数据集
加油站营销推荐算法-MPC V1.0 final.pdf

In [3]:
!ls 公开数据集/

Bank_data.csv          PetrolStation_data.csv VehicleSystem_data.csv

## 2.初步探索数据

In [4]:
bank = pd.read_csv('./公开数据集/Bank_data.csv')
petro = pd.read_csv('./公开数据集/PetrolStation_data.csv')
vehicle = pd.read_csv('./公开数据集/VehicleSystem_data.csv')

In [5]:
bank.shape

(2537, 12)

In [6]:
petro.shape

(2537, 6)

In [7]:
vehicle.shape

(2537, 7)

In [8]:
#拼接三张表
origin_data = pd.concat([bank, petro, vehicle], axis=1)

In [9]:
origin_data.describe(include = 'all')

,ID,gender,age,maritalStatus,education,occupation,income,Bar,CoffeeHouse,CarryAway,RestaurantLessThan20,Restaurant20To50,ID,weather,time,coupon,expiration,Y,ID,destination,passanger,toCoupon_GEQ15min,toCoupon_GEQ25min,direction_same,direction_opp
count,2537.00000,2537,2537,2537,2537,2537,2537,2522,2506,2510,2521,2503,2537.00000,2537,2537,2537,2537,2537.000000,2537.00000,2537,2537,2537.000000,2537.000000,2537.000000,2537.000000
unique,NaN,2,8,5,6,25,9,5,5,5,5,5,NaN,3,5,5,2,NaN,NaN,3,4,NaN,NaN,NaN,NaN
top,NaN,Male,21,Married partner,Some college - no degree,Unemployed,$25000 - $37499,never,less1,1~3,1~3,less1,NaN,Sunny,6PM,Coffee House,1d,NaN,NaN,No Urgent Place,Alone,NaN,NaN,NaN,NaN
freq,NaN,1269,567,1036,883,372,408,992,676,941,1099,1249,NaN,2006,654,754,1437,NaN,NaN,1204,1493,NaN,NaN,NaN,NaN
mean,16465.87229,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,16465.87229,NaN,NaN,NaN,NaN,0.568388,16465.87229,NaN,NaN,0.569176,0.131257,0.223492,0.776508
std,3656.59043,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3656.59043,NaN,NaN,NaN,NaN,0.495399,3656.59043,NaN,NaN,0.495289,0.337748,0.416668,0.416668
min,10004.00000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,10004.00000,NaN,NaN,NaN,NaN,0.000000,10004.00000,NaN,NaN,0.000000,0.000000,0.000000,0.000000
25%,13268.00000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,13268.00000,NaN,NaN,NaN,NaN,0.000000,13268.00000,NaN,NaN,0.000000,0.000000,0.000000,1.000000
50%,16538.00000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,16538.00000,NaN,NaN,NaN,NaN,1.000000,16538.00000,NaN,NaN,1.000000,0.000000,0.000000,1.000000
75%,19660.00000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,19660.00000,NaN,NaN,NaN,NaN,1.000000,19660.00000,NaN,NaN,1.000000,0.000000,0.000000,1.000000
max,22683.00000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,22683.00000,NaN,NaN,NaN,NaN,1.000000,22683.00000,NaN,NaN,1.000000,1.000000,1.000000,1.000000

In [10]:
origin_data.head()

,ID,gender,age,maritalStatus,education,occupation,income,Bar,CoffeeHouse,CarryAway,RestaurantLessThan20,Restaurant20To50,ID,weather,time,coupon,expiration,Y,ID,destination,passanger,toCoupon_GEQ15min,toCoupon_GEQ25min,direction_same,direction_opp
0,11263,Male,50plus,Widowed,Some college - no degree,Construction & Extraction,Less than $12500,never,never,less1,1~3,less1,11263,Sunny,2PM,Coffee House,1d,1,11263,No Urgent Place,Friend(s),0,0,0,1
1,20136,Female,26,Married partner,Some college - no degree,Office & Administrative Support,$75000 - $87499,never,never,1~3,4~8,less1,20136,Sunny,7AM,Bar,1d,0,20136,Work,Alone,1,0,1,0
2,14763,Female,50plus,Single,Bachelors degree,Retired,$37500 - $49999,never,never,less1,4~8,less1,14763,Sunny,7AM,Coffee House,1d,0,14763,Work,Alone,1,0,0,1
3,12612,Female,41,Married partner,Bachelors degree,Legal,$100000 or More,never,1~3,1~3,1~3,less1,12612,Sunny,10AM,Carry out & Take away,2h,0,12612,No Urgent Place,Kid(s),1,0,0,1
4,17850,Female,31,Married partner,Some college - no degree,Computer & Mathematical,$100000 or More,less1,less1,gt8,4~8,less1,17850,Snowy,2PM,Coffee House,2h,0,17850,No Urgent Place,Partner,1,0,0,1

In [11]:
!head ./公开数据集/Bank_data.csv

ID,gender,age,maritalStatus,education,occupation,income,Bar,CoffeeHouse,CarryAway,RestaurantLessThan20,Restaurant20To50
11263,Male,50plus,Widowed,Some college - no degree,Construction & Extraction,Less than $12500,never,never,less1,1~3,less1
20136,Female,26,Married partner,Some college - no degree,Office & Administrative Support,$75000 - $87499,never,never,1~3,4~8,less1
14763,Female,50plus,Single,Bachelors degree,Retired,$37500 - $49999,never,never,less1,4~8,less1
12612,Female,41,Married partner,Bachelors degree,Legal,$100000 or More,never,1~3,1~3,1~3,less1
17850,Female,31,Married partner,Some college - no degree,Computer & Mathematical,$100000 or More,less1,less1,gt8,4~8,less1
14214,Male,41,Married partner,Graduate degree (Masters or Doctorate),Computer & Mathematical,$37500 - $49999,less1,less1,gt8,gt8,4~8
14821,Female,31,Single,Bachelors degree,Community & Social Services,$50000 - $62499,4~8,1~3,1~3,1~3,less1
18046,Male,31,Single,Some college - no degree,Unemployed,$12500 - $24999,1~3,less1,4~8,less1,never
21932,Female,31,Married partner,Some college - no degree,Computer & Mathematical,$100000 or More,less1,less1,gt8,4~8,less1

In [12]:
bank.head()

,ID,gender,age,maritalStatus,education,occupation,income,Bar,CoffeeHouse,CarryAway,RestaurantLessThan20,Restaurant20To50
0,11263,Male,50plus,Widowed,Some college - no degree,Construction & Extraction,Less than $12500,never,never,less1,1~3,less1
1,20136,Female,26,Married partner,Some college - no degree,Office & Administrative Support,$75000 - $87499,never,never,1~3,4~8,less1
2,14763,Female,50plus,Single,Bachelors degree,Retired,$37500 - $49999,never,never,less1,4~8,less1
3,12612,Female,41,Married partner,Bachelors degree,Legal,$100000 or More,never,1~3,1~3,1~3,less1
4,17850,Female,31,Married partner,Some college - no degree,Computer & Mathematical,$100000 or More,less1,less1,gt8,4~8,less1

In [13]:
bank.describe(include = "all")

,ID,gender,age,maritalStatus,education,occupation,income,Bar,CoffeeHouse,CarryAway,RestaurantLessThan20,Restaurant20To50
count,2537.00000,2537,2537,2537,2537,2537,2537,2522,2506,2510,2521,2503
unique,NaN,2,8,5,6,25,9,5,5,5,5,5
top,NaN,Male,21,Married partner,Some college - no degree,Unemployed,$25000 - $37499,never,less1,1~3,1~3,less1
freq,NaN,1269,567,1036,883,372,408,992,676,941,1099,1249
mean,16465.87229,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,3656.59043,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,10004.00000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,13268.00000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,16538.00000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,19660.00000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,22683.00000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
# 查看数据结构
bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2537 entries, 0 to 2536
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   ID                    2537 non-null   int64
 1   gender                2537 non-null   object
 2   age                   2537 non-null   object
 3   maritalStatus         2537 non-null   object
 4   education             2537 non-null   object
 5   occupation            2537 non-null   object
 6   income                2537 non-null   object
 7   Bar                   2522 non-null   object
 8   CoffeeHouse           2506 non-null   object
 9   CarryAway             2510 non-null   object
 10  RestaurantLessThan20  2521 non-null   object
 11  Restaurant20To50      2503 non-null   object
dtypes: int64(1), object(11)
memory usage: 238.0+ KB

In [15]:
#查看数据形状
bank.shape

(2537, 12)

## 3.简单数据处理

In [16]:
print(bank.dtypes)

ID                       int64
gender                  object
age                     object
maritalStatus           object
education               object
occupation              object
income                  object
Bar                     object
CoffeeHouse             object
CarryAway               object
RestaurantLessThan20    object
Restaurant20To50        object
dtype: object

In [17]:
bank.columns

Index(['ID', 'gender', 'age', 'maritalStatus', 'education', 'occupation',
       'income', 'Bar', 'CoffeeHouse', 'CarryAway', 'RestaurantLessThan20',
       'Restaurant20To50'],
      dtype='object')

In [18]:
#‘gender’列统一转为小写字母
bank['gender'] = bank['gender'].str.lower()

In [19]:
bank['gender']

0         male
1       female
2       female
3       female
4       female
         ...
2532    female
2533      male
2534      male
2535      male
2536    female
Name: gender, Length: 2537, dtype: object

In [20]:
bank.head()

,ID,gender,age,maritalStatus,education,occupation,income,Bar,CoffeeHouse,CarryAway,RestaurantLessThan20,Restaurant20To50
0,11263,male,50plus,Widowed,Some college - no degree,Construction & Extraction,Less than $12500,never,never,less1,1~3,less1
1,20136,female,26,Married partner,Some college - no degree,Office & Administrative Support,$75000 - $87499,never,never,1~3,4~8,less1
2,14763,female,50plus,Single,Bachelors degree,Retired,$37500 - $49999,never,never,less1,4~8,less1
3,12612,female,41,Married partner,Bachelors degree,Legal,$100000 or More,never,1~3,1~3,1~3,less1
4,17850,female,31,Married partner,Some college - no degree,Computer & Mathematical,$100000 or More,less1,less1,gt8,4~8,less1

**统计各列的不同值出现次数**

In [21]:
bank['gender'].value_counts()

male      1269
female    1268
Name: gender, dtype: int64

In [22]:
bank['maritalStatus'].value_counts()

Married partner      1036
Single                949
Unmarried partner     433
Divorced               96
Widowed                23
Name: maritalStatus, dtype: int64

In [23]:
bank['education'].value_counts()

Some college - no degree                  883
Bachelors degree                          880
Graduate degree (Masters or Doctorate)    361
Associates degree                         212
High School Graduate                      187
Some High School                           14
Name: education, dtype: int64

In [24]:
bank['occupation'].value_counts()

Unemployed                                   372
Student                                      333
Computer & Mathematical                      301
Sales & Related                              198
Education&Training&Library                   191
Management                                   172
Office & Administrative Support              131
Arts Design Entertainment Sports & Media     118
Business & Financial                         113
Retired                                       99
Food Preparation & Serving Related            61
Transportation & Material Moving              44
Healthcare Support                            43
Healthcare Practitioners & Technical          43
Community & Social Services                   41
Legal                                         38
Architecture & Engineering                    35
Protective Service                            34
Life Physical Social Science                  34
Construction & Extraction                     34
Personal Care & Service                       33
Installation Maintenance & Repair             25
Production Occupations                        24
Building & Grounds Cleaning & Maintenance     13
Farming Fishing & Forestry                     7
Name: occupation, dtype: int64

In [25]:
bank['income'].value_counts()

$25000 - $37499     408
$100000 or More     351
$50000 - $62499     350
$12500 - $24999     347
$37500 - $49999     344
Less than $12500    214
$75000 - $87499     189
$87500 - $99999     168
$62500 - $74999     166
Name: income, dtype: int64

In [26]:
bank['age'].value_counts()

21         567
26         492
31         414
50plus     354
36         249
41         220
46         143
below21     98
Name: age, dtype: int64

In [27]:
bank['RestaurantLessThan20'].value_counts()

1~3      1099
4~8       720
less1     421
gt8       244
never      37
Name: RestaurantLessThan20, dtype: int64

In [28]:
bank['Restaurant20To50'].value_counts()

less1    1249
1~3       648
never     408
4~8       155
gt8        43
Name: Restaurant20To50, dtype: int64

## 4. 缺失值的处理

```python
df.isnull() #查看缺失值
df.notnull() #查看不是缺失值的数据
df.dropna() #删除缺失值
df.fillna() #填补缺失值
```

In [29]:
bank.isnull().sum()

ID                       0
gender                   0
age                      0
maritalStatus            0
education                0
occupation               0
income                   0
Bar                     15
CoffeeHouse             31
CarryAway               27
RestaurantLessThan20    16
Restaurant20To50        34
dtype: int64

In [30]:
bank[bank.Bar.isnull()]

,ID,gender,age,maritalStatus,education,occupation,income,Bar,CoffeeHouse,CarryAway,RestaurantLessThan20,Restaurant20To50
11,22156,female,31,Single,Associates degree,Arts Design Entertainment Sports & Media,$75000 - $87499,NaN,less1,gt8,1~3,less1
66,10519,male,50plus,Divorced,Some college - no degree,Management,$62500 - $74999,NaN,NaN,NaN,NaN,NaN
102,10857,male,41,Married partner,Bachelors degree,Unemployed,$87500 - $99999,NaN,NaN,NaN,NaN,NaN
657,22168,female,31,Single,Associates degree,Arts Design Entertainment Sports & Media,$75000 - $87499,NaN,less1,gt8,1~3,less1
933,12884,female,36,Married partner,Bachelors degree,Education&Training&Library,$50000 - $62499,NaN,1~3,4~8,1~3,1~3
1094,20382,male,41,Married partner,Bachelors degree,Arts Design Entertainment Sports & Media,$37500 - $49999,NaN,less1,1~3,4~8,1~3
1335,22170,female,31,Single,Associates degree,Arts Design Entertainment Sports & Media,$75000 - $87499,NaN,less1,gt8,1~3,less1
1441,22171,female,31,Single,Associates degree,Arts Design Entertainment Sports & Media,$75000 - $87499,NaN,less1,gt8,1~3,less1
1498,12879,female,36,Married partner,Bachelors degree,Education&Training&Library,$50000 - $62499,NaN,1~3,4~8,1~3,1~3
1565,22169,female,31,Single,Associates degree,Arts Design Entertainment Sports & Media,$75000 - $87499,NaN,less1,gt8,1~3,less1
1628,12883,female,36,Married partner,Bachelors degree,Education&Training&Library,$50000 - $62499,NaN,1~3,4~8,1~3,1~3
1634,20401,male,41,Married partner,Bachelors degree,Arts Design Entertainment Sports & Media,$37500 - $49999,NaN,less1,1~3,4~8,1~3
1754,22159,female,31,Single,Associates degree,Arts Design Entertainment Sports & Media,$75000 - $87499,NaN,less1,gt8,1~3,less1
1792,12893,female,36,Married partner,Bachelors degree,Education&Training&Library,$50000 - $62499,NaN,1~3,4~8,1~3,1~3
2217,12872,female,36,Married partner,Bachelors degree,Education&Training&Library,$50000 - $62499,NaN,1~3,4~8,1~3,1~3